XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/timer_reg.h
/* 0xB4 : Timer2 Counter Sync Value */
#define TIMER_TCVSYN2_OFFSET     (0xB4)
#define TIMER_TCR2_CNT_SYNC      TIMER_TCR2_CNT_SYNC
#define TIMER_TCR2_CNT_SYNC_POS  (0U)
#define TIMER_TCR2_CNT_SYNC_LEN  (32U)
#define TIMER_TCR2_CNT_SYNC_MSK  (((1U << TIMER_TCR2_CNT_SYNC_LEN) - 1) << TIMER_TCR2_CNT_SYNC_POS)
#define TIMER_TCR2_CNT_SYNC_UMSK (~(((1U << TIMER_TCR2_CNT_SYNC_LEN) - 1) << TIMER_TCR2_CNT_SYNC_POS))

/* 0xB8 : Timer3 Counter Sync Value */
#define TIMER_TCVSYN3_OFFSET     (0xB8)
#define TIMER_TCR3_CNT_SYNC      TIMER_TCR3_CNT_SYNC
#define TIMER_TCR3_CNT_SYNC_POS  (0U)
#define TIMER_TCR3_CNT_SYNC_LEN  (32U)
#define TIMER_TCR3_CNT_SYNC_MSK  (((1U << TIMER_TCR3_CNT_SYNC_LEN) - 1) << TIMER_TCR3_CNT_SYNC_POS)
#define TIMER_TCR3_CNT_SYNC_UMSK (~(((1U << TIMER_TCR3_CNT_SYNC_LEN) - 1) << TIMER_TCR3_CNT_SYNC_POS))

/* 0xBC : Timer Division */
#define TIMER_TCDR_OFFSET (0xBC)
#define TIMER_TCDR2       TIMER_TCDR2
#define TIMER_TCDR2_POS   (8U)
#define TIMER_TCDR2_LEN   (8U)
#define TIMER_TCDR2_MSK   (((1U << TIMER_TCDR2_LEN) - 1) << TIMER_TCDR2_POS)
#define TIMER_TCDR2_UMSK  (~(((1U << TIMER_TCDR2_LEN) - 1) << TIMER_TCDR2_POS))
#define TIMER_TCDR3       TIMER_TCDR3
#define TIMER_TCDR3_POS   (16U)
#define TIMER_TCDR3_LEN   (8U)
#define TIMER_TCDR3_MSK   (((1U << TIMER_TCDR3_LEN) - 1) << TIMER_TCDR3_POS)
#define TIMER_TCDR3_UMSK  (~(((1U << TIMER_TCDR3_LEN) - 1) << TIMER_TCDR3_POS))
#define TIMER_WCDR        TIMER_WCDR
#define TIMER_WCDR_POS    (24U)
#define TIMER_WCDR_LEN    (8U)
#define TIMER_WCDR_MSK    (((1U << TIMER_WCDR_LEN) - 1) << TIMER_WCDR_POS)
#define TIMER_WCDR_UMSK   (~(((1U << TIMER_WCDR_LEN) - 1) << TIMER_WCDR_POS))

/* 0xC0 : GPIO Mode */
#define TIMER_GPIO_OFFSET       (0xC0)
#define TIMER2_GPIO_EN          TIMER2_GPIO_EN
#define TIMER2_GPIO_EN_POS      (1U)
#define TIMER2_GPIO_EN_LEN      (1U)
#define TIMER2_GPIO_EN_MSK      (((1U << TIMER2_GPIO_EN_LEN) - 1) << TIMER2_GPIO_EN_POS)
#define TIMER2_GPIO_EN_UMSK     (~(((1U << TIMER2_GPIO_EN_LEN) - 1) << TIMER2_GPIO_EN_POS))
#define TIMER2_GPIO_INV         TIMER2_GPIO_INV
#define TIMER2_GPIO_INV_POS     (5U)
#define TIMER2_GPIO_INV_LEN     (1U)
#define TIMER2_GPIO_INV_MSK     (((1U << TIMER2_GPIO_INV_LEN) - 1) << TIMER2_GPIO_INV_POS)
#define TIMER2_GPIO_INV_UMSK    (~(((1U << TIMER2_GPIO_INV_LEN) - 1) << TIMER2_GPIO_INV_POS))
#define TIMER3_GPIO_INV         TIMER3_GPIO_INV
#define TIMER3_GPIO_INV_POS     (6U)
#define TIMER3_GPIO_INV_LEN     (1U)
#define TIMER3_GPIO_INV_MSK     (((1U << TIMER3_GPIO_INV_LEN) - 1) << TIMER3_GPIO_INV_POS)
#define TIMER3_GPIO_INV_UMSK    (~(((1U << TIMER3_GPIO_INV_LEN) - 1) << TIMER3_GPIO_INV_POS))
#define TIMER_WDT_GPIO_INV      TIMER_WDT_GPIO_INV
#define TIMER_WDT_GPIO_INV_POS  (7U)
#define TIMER_WDT_GPIO_INV_LEN  (1U)
#define TIMER_WDT_GPIO_INV_MSK  (((1U << TIMER_WDT_GPIO_INV_LEN) - 1) << TIMER_WDT_GPIO_INV_POS)
#define TIMER_WDT_GPIO_INV_UMSK (~(((1U << TIMER_WDT_GPIO_INV_LEN) - 1) << TIMER_WDT_GPIO_INV_POS))
#define TIMER_GPIO_LAT_OK       TIMER_GPIO_LAT_OK
#define TIMER_GPIO_LAT_OK_POS   (31U)
#define TIMER_GPIO_LAT_OK_LEN   (1U)
#define TIMER_GPIO_LAT_OK_MSK   (((1U << TIMER_GPIO_LAT_OK_LEN) - 1) << TIMER_GPIO_LAT_OK_POS)
#define TIMER_GPIO_LAT_OK_UMSK  (~(((1U << TIMER_GPIO_LAT_OK_LEN) - 1) << TIMER_GPIO_LAT_OK_POS))

/* 0xC4 : GPIO Latch Value1 */
#define TIMER_GPIO_LAT1_OFFSET (0xC4)
#define TIMER_GPIO_LAT1        TIMER_GPIO_LAT1
#define TIMER_GPIO_LAT1_POS    (0U)
#define TIMER_GPIO_LAT1_LEN    (32U)
#define TIMER_GPIO_LAT1_MSK    (((1U << TIMER_GPIO_LAT1_LEN) - 1) << TIMER_GPIO_LAT1_POS)
#define TIMER_GPIO_LAT1_UMSK   (~(((1U << TIMER_GPIO_LAT1_LEN) - 1) << TIMER_GPIO_LAT1_POS))

/* 0xC8 : GPIO Latch Value2 */
#define TIMER_GPIO_LAT2_OFFSET (0xC8)
#define TIMER_GPIO_LAT2        TIMER_GPIO_LAT2
#define TIMER_GPIO_LAT2_POS    (0U)
#define TIMER_GPIO_LAT2_LEN    (32U)
#define TIMER_GPIO_LAT2_MSK    (((1U << TIMER_GPIO_LAT2_LEN) - 1) << TIMER_GPIO_LAT2_POS)
#define TIMER_GPIO_LAT2_UMSK   (~(((1U << TIMER_GPIO_LAT2_LEN) - 1) << TIMER_GPIO_LAT2_POS))

/* 0xCC : Timer Division Force */
#define TIMER_TCDR_FORCE_OFFSET (0xCC)
#define TIMER_TCDR2_FORCE       TIMER_TCDR2_FORCE
#define TIMER_TCDR2_FORCE_POS   (1U)
#define TIMER_TCDR2_FORCE_LEN   (1U)
#define TIMER_TCDR2_FORCE_MSK   (((1U << TIMER_TCDR2_FORCE_LEN) - 1) << TIMER_TCDR2_FORCE_POS)
#define TIMER_TCDR2_FORCE_UMSK  (~(((1U << TIMER_TCDR2_FORCE_LEN) - 1) << TIMER_TCDR2_FORCE_POS))
#define TIMER_TCDR3_FORCE       TIMER_TCDR3_FORCE
#define TIMER_TCDR3_FORCE_POS   (2U)
#define TIMER_TCDR3_FORCE_LEN   (1U)
#define TIMER_TCDR3_FORCE_MSK   (((1U << TIMER_TCDR3_FORCE_LEN) - 1) << TIMER_TCDR3_FORCE_POS)
#define TIMER_TCDR3_FORCE_UMSK  (~(((1U << TIMER_TCDR3_FORCE_LEN) - 1) << TIMER_TCDR3_FORCE_POS))
#define TIMER_WCDR_FORCE        TIMER_WCDR_FORCE
#define TIMER_WCDR_FORCE_POS    (4U)
#define TIMER_WCDR_FORCE_LEN    (1U)
#define TIMER_WCDR_FORCE_MSK    (((1U << TIMER_WCDR_FORCE_LEN) - 1) << TIMER_WCDR_FORCE_POS)
#define TIMER_WCDR_FORCE_UMSK   (~(((1U << TIMER_WCDR_FORCE_LEN) - 1) << TIMER_WCDR_FORCE_POS))

struct timer_reg {
    /* 0x0 : Timer Clock Source */
    union {
        struct {
            uint32_t cs_2           : 4; /* [ 3: 0],        r/w,        0x5 */
            uint32_t cs_3           : 4; /* [ 7: 4],        r/w,        0x5 */
            uint32_t cs_wdt         : 4; /* [11: 8],        r/w,        0x1 */
            uint32_t reserved_12_15 : 4; /* [15:12],       rsvd,        0x0 */
            uint32_t tmr_rsv        : 8; /* [23:16],       rsvd,        0x0 */
            uint32_t ID             : 8; /* [31:24],          r,       0xa5 */
        } BF;
        uint32_t WORD;
    } TCCR;

    /* 0x4  reserved */
    uint8_t RESERVED0x4[12];

    /* 0x10 : Timer2 Match Value 0 */
    union {
        struct {
            uint32_t tmr2_0 : 32; /* [31: 0],        r/w, 0xffffffff */
        } BF;
        uint32_t WORD;
    } TMR2_0;

    /* 0x14 : Timer2 Match Value 1 */
    union {
        struct {
            uint32_t tmr2_1 : 32; /* [31: 0],        r/w, 0xffffffff */
        } BF;
        uint32_t WORD;
    } TMR2_1;

